org/colloquium/za_6.tex
% Created 2017-09-01 Fri 13:45
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\author{Napredne tehnike programiranja}
\date{1. septembar 2017.}
\title{Test za 6}
\hypersetup{
 pdfauthor={Napredne tehnike programiranja},
 pdftitle={Test za 6},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.1 (Org mode 9.0.10)},
 pdflang={Serbian}}
\begin{document}

\maketitle

\section{Da li je Python eksplicitno tipiziran programski jezik? Objasnite.}
\label{sec:orgba3175e}

\begin{itemize}
\item

\item

\item

\item

\item
\end{itemize}

\section{Da li je Python strogo tipiziran (\emph{strongly typed}) programski jezik? Dati primer.}
\label{sec:orgf2c0cf5}

\begin{itemize}
\item

\item

\item

\item

\item
\end{itemize}

\section{Objasnite proces parsiranja.}
\label{sec:org17df3b2}

\begin{itemize}
\item

\item

\item

\item

\item
\end{itemize}

\section{Da li je Clojure dinamički tipiziran programski jezik?}
\label{sec:org4a1ad87}

\begin{itemize}
\item

\item

\item

\item

\item
\end{itemize}

\section{Objasnite (svojim rečima) šta je makro sistem Lisp-a.}
\label{sec:org37b4477}

\begin{itemize}
\item

\item

\item

\item

\item
\end{itemize}

\section{Šta su funkcije višeg reda?}
\label{sec:orge35bfd9}

\begin{itemize}
\item

\item

\item

\item

\item
\end{itemize}

\section{Objasnite kako funkcioniše proces konstrukcije objekta u Smalltalk-u. Dajte jedan primer klase u Smalltalk-u.}
\label{sec:org7644dba}

\begin{itemize}
\item

\item

\item

\item

\item
\end{itemize}

\section{Objasniti šta je \emph{curry-ing}. Dajte jedan primer u programskom jeziku Haskell.}
\label{sec:org458bfac}

\begin{itemize}
\item

\item

\item

\item

\item
\end{itemize}

\section{Šta je \emph{typeclass} u Haskell-u?}
\label{sec:orgb99a31f}

\begin{itemize}
\item

\item

\item

\item

\item
\end{itemize}

\section{Šta znači da je programski jezik \emph{lazy}?}
\label{sec:orgae56ff5}

\begin{itemize}
\item

\item

\item

\item

\item
\end{itemize}
\end{document}
